SMSServerGui/app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT * FROM `buildings`

  def show
    @building = Building.find(params[:id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)

  def edit
    @building = Building.find(params[:id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)

  def create
    @building = Building.new(params[:building])

    respond_to do |format|
      if @building.save
---
INSERT INTO `buildings` (`name`) VALUES('Bhaban4')

  def update
    @building = Building.find(params[:id])

    respond_to do |format|
      if @building.update_attributes(params[:building])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 6)
UPDATE `buildings` SET `name` = 'Bhaban5' WHERE `id` = 6

  def destroy
    @building = Building.find(params[:id])
    @building.destroy
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 9)
DELETE FROM `buildings` WHERE `id` = 9