SMSServerGui/app/controllers/equipments_controller.rb

SELECT * FROM `equipment`
---
  def index
    @equipments = Equipment.all

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 6)
---
  def show
    @equipment = Equipment.find(params[:id])

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 6)
---
  def edit
    @equipment = Equipment.find(params[:id])