SMSServerGui/app/controllers/flats_controller.rb

  def index
    @flats = Flat.all
---
SELECT * FROM `flats`

  def show
    @flat = Flat.find(params[:id])
---
SELECT * FROM `flats` WHERE (`flats`.`id` = 2)

  def edit
    @flat = Flat.find(params[:id])
---
SELECT * FROM `flats` WHERE (`flats`.`id` = 2)

  def create
    @flat = Flat.new(params[:flat])

    respond_to do |format|
      if @flat.save
---
INSERT INTO `flats` (`name`) VALUES('flat4')