SMSServerGui/app/controllers/floors_controller.rb

  def index
    @floors = Floor.all
---
SELECT * FROM `floors`

  def show
    @floor = Floor.find(params[:id])
---
SELECT * FROM `floors` WHERE (`floors`.`id` = 2)

  def edit
    @floor = Floor.find(params[:id])
---
SELECT * FROM `floors` WHERE (`floors`.`id` = 2)

  def create
    @floor = Floor.new(params[:floor])

    respond_to do |format|
      if @floor.save
---
INSERT INTO `floors` (`name`) VALUES('floor4')