SMSServerGui/app/controllers/hosts_controller.rb

  def index
    @hosts = Host.all
---
SELECT * FROM `hosts`

  def show
    @host = Host.find(params[:id])
---
SELECT * FROM `hosts` WHERE (`hosts`.`id` = 1)

  def edit
    @host = Host.find(params[:id])
---
SELECT * FROM `hosts` WHERE (`hosts`.`id` = 1)