SMSServerGui/app/controllers/parallel_configurations_controller.rb

  def show
    @parallel_management = ParallelManagement.find(params[:id])
---
SELECT * FROM `parallel_managements` WHERE (`parallel_managements`.`id` = 33)