SMSServerGui/app/controllers/parallel_controls_controller.rb

  def index
    @parallel_controls = ParallelManagement.all
---
SELECT * FROM `parallel_managements`

   def update_buildings
    # updates artists and songs based on genre selected
    building = Building.find(params[:building_id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 4)