SMSServerGui/app/controllers/parallel_managements_controller.rb

  def index
    @parallel_managements = ParallelManagement.all
---
SELECT * FROM `parallel_managements`

  def show
    @parallel_management = ParallelManagement.find(params[:id])
---
SELECT * FROM `parallel_managements` WHERE (`parallel_managements`.`id` = 8)

  def edit
    @parallel_management = ParallelManagement.find(params[:id])
---
SELECT * FROM `parallel_managements` WHERE (`parallel_managements`.`id` = 1)

  def create
    @parallel_management = ParallelConfiguration.new(params[:parallel_management])

    respond_to do |format|
      if @parallel_management.save
---
INSERT INTO `parallel_configurations` (`equipment2_id`, `flat_id`, `equipment5_id`, `equipment6_id`, `equipment3_id`, `floor_id`, `room_id`, `building_id`, `host_id`, `equipment4_id`, `equipment7_id`, `device_id`, `equipment1_id`, `equipment8_id`) VALUES(6, 1, 6, 6, 6, 1, 1, 1, 1, 6, 6, 1, 6, 6)

  def update
    @parallel_management = ParallelConfiguration.find(params[:id])

    respond_to do |format|
      if @parallel_management.update_attributes(params[:parallel_management])
---
SELECT * FROM `parallel_configurations` WHERE (`parallel_configurations`.`id` = 38)
UPDATE `parallel_configurations` SET `equipment8_id` = 2, `equipment2_id` = 1, `equipment5_id` = 8, `equipment7_id` = 3, `equipment4_id` = 7, `equipment6_id` = 5 WHERE `id` = 34

  def destroy
    @parallel_management = ParallelConfiguration.find(params[:id])
    @parallel_management.destroy
---
SELECT * FROM `parallel_configurations` WHERE (`parallel_configurations`.`id` = 35)
DELETE FROM `parallel_configurations` WHERE `id` = 35