SMSServerGui/app/controllers/rooms_controller.rb

SELECT * FROM `rooms`
---
  def index
    @rooms = Room.all

SELECT * FROM `rooms` WHERE (`rooms`.`id` = 2)
---
  def show
    @room = Room.find(params[:id])

SELECT * FROM `rooms` WHERE (`rooms`.`id` = 1)
---
  def edit
    @room = Room.find(params[:id])

INSERT INTO `rooms` (`name`) VALUES('room4')
---
  def create
    @room = Room.new(params[:room])

    respond_to do |format|
      if @room.save