SMSServerGui/app/controllers/welcome_controller.rb

DELETE FROM `smsserver_out_messages`
---
  def clear_sms_queue
      SmsserverOutMessage.delete_all

SELECT * FROM `smsserver_out_messages` WHERE (status = 'U' or status = 'Q') ORDER BY create_date LIMIT 0, 10
---
  def send_sms_queue
   @queued_sms =  SmsserverOutMessage.paginate( :all,:conditions => [ "status = ? or status = ?" , 'U','Q' ] , :order => "create_date",:page => params[ :page ] ,:per_page => 10 )

SELECT * FROM `smsserver_in_messages` WHERE (process='0') ORDER BY receive_date desc LIMIT 0, 10
SELECT count(*) AS count_all FROM `smsserver_in_messages` WHERE (process='0')
UPDATE `smsserver_in_messages` SET `process` = 1 WHERE `id` = 1
---
  def received_sms
      @received_sms = SmsserverInMessage.paginate( :all , :conditions => [ "process=?" , '0' ], :page => params[ :page ] , :order => 'receive_date desc' , :per_page => 10 )
      session[ :notice ] = "You have #{@received_sms.total_entries} new sms"
      @received_sms.each{ |message| message.process='1' ; message.save }

SELECT * FROM `smsserver_calls` WHERE (isread='0') ORDER BY call_date desc LIMIT 0, 10
---
  def missed_calls

     @calls =  SmsserverCall.paginate( :all , :conditions =>  [ "isread=?" , '0' ]  ,:page => params[ :page ] , :order => 'call_date desc' , :per_page => 10 )

SELECT * FROM `outgoing_sms_content_groups` WHERE (`outgoing_sms_content_groups`.`id` = '1') LIMIT 1
---
  def get_message_group_value
     row =  OutgoingSmsContentGroup.find_by_id( params[ "content_group_id" ] )

SELECT * FROM `outgoing_sms_number_groups` WHERE (`outgoing_sms_number_groups`.`id` = '1') LIMIT 1
---
  def get_number_group_value
     row =  OutgoingSmsNumberGroup.find_by_id( params[ "number_group_id" ] )